{
  "generatedAt": "2025-10-22T03:13:40.189Z",
  "source": "senate.json",
  "attempts": [
    {
      "stage": "senate.json",
      "status": "ok",
      "rawCount": 11,
      "parsedCount": 11,
      "dropReasons": {
        "missingDate": 0,
        "missingCommittee": 0
      }
    }
  ],
  "warnings": [],
  "parsedCount": 11,
  "preview": [
    {
      "id": "senate-1",
      "branch": "Senate",
      "committee": "(Health and Demography joint with Social Justice, Welfare and Rural Development; and Finance (TWG))(CANCELLED as of 4:04 p.m., Oct. 21, 2025, Tues., by Horace R. Cruda, Committee Secretary)",
      "date": "2025-10-22",
      "time": "(9:00 A.M.",
      "venue": "via Zoom Sen. M.L. Quezon Room 2/F Right Wing, Senate)",
      "agenda": "S. Nos. 404 and 409 - Medical Assistance to Indigent and Financially Incapacitated Patients (MAIFIP) Program (By: Sens. Lacson and Go)",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-10-22T09:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate (health and demography joint with social justice, welfare and rural development; and finance (twg))(cancelled as of 4:04 p.m., oct. 21, 2025, tues., by horace r. cruda, committee secretary) via zoom sen. m.l. quezon room 2/f right wing, senate) s. nos. 404 and 409 - medical assistance to indigent and financially incapacitated patients (maifip) program (by: sens. lacson and go) scheduled"
    },
    {
      "id": "senate-2",
      "branch": "Senate",
      "committee": "Agriculture, Food and Agrarian Reform joint with Cooperatives; Ways and Means; and Finance (Presiding: Sen. Pangilinan)",
      "date": "2025-10-22",
      "time": "9:00 A.M.",
      "venue": "Sen. A.B. Padilla Room 2/F Right Wing, Senate",
      "agenda": "S. Nos. 389 and 1183 – Agricultural Cooperatives (By: Sens. Hontiveros and Pangilinan); S. N. 1182 – National Agriculture and Fisheries Extension System (By: Sen. Pangilinan); S. Nos. 1199 and 1345 – Creation of a Congressional Commission on Agriculture, Fisheries and Food Security (By: Sens. Pangilinan and Marcos)",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-10-22T09:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate agriculture, food and agrarian reform joint with cooperatives; ways and means; and finance (presiding: sen. pangilinan) sen. a.b. padilla room 2/f right wing, senate s. nos. 389 and 1183 – agricultural cooperatives (by: sens. hontiveros and pangilinan); s. n. 1182 – national agriculture and fisheries extension system (by: sen. pangilinan); s. nos. 1199 and 1345 – creation of a congressional commission on agriculture, fisheries and food security (by: sens. pangilinan and marcos) scheduled"
    },
    {
      "id": "senate-3",
      "branch": "Senate",
      "committee": "Finance (Subcommittee A) (Presiding: Sen. Gatchalian)",
      "date": "2025-10-22",
      "time": "10:00 A.M.",
      "venue": "Sen. C.M. Recto Room Sen. J.P. Laurel Room 2/F Right Wing, Senate",
      "agenda": "FY 2026 Proposed Budget of the Department of Labor and Employment and attached agencies",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-10-22T10:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate finance (subcommittee a) (presiding: sen. gatchalian) sen. c.m. recto room sen. j.p. laurel room 2/f right wing, senate fy 2026 proposed budget of the department of labor and employment and attached agencies scheduled"
    },
    {
      "id": "senate-4",
      "branch": "Senate",
      "committee": "Ways and Means (Presiding: Sen. P. Cayetano)(RESCHEDULED as of 5:56 p.m., by Atty. Rachel L. Yuawan, Committee Secretary, Director II, TPAB-STSRO)",
      "date": "2025-10-22",
      "time": "11:00 A.M.",
      "venue": "Sen. V.Y. Sotto Room 2/F Right Wing, Senate",
      "agenda": "Organizational Meeting; Briefing by the DOF, BIR, BOC, NTRC, FIRB and DOTr officials",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-10-22T11:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate ways and means (presiding: sen. p. cayetano)(rescheduled as of 5:56 p.m., by atty. rachel l. yuawan, committee secretary, director ii, tpab-stsro) sen. v.y. sotto room 2/f right wing, senate organizational meeting; briefing by the dof, bir, boc, ntrc, firb and dotr officials scheduled"
    },
    {
      "id": "senate-5",
      "branch": "Senate",
      "committee": "Finance (Subcommittee A) (Presiding: Sen. Gatchalian)",
      "date": "2025-10-22",
      "time": "2:00 P.M.",
      "venue": "Sen. G.T. Pecson Room 2/F Right Wing, Senate",
      "agenda": "FY 2026 Proposed Budget of the Department of Information and Communications Technology and attached agencies",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-10-22T02:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate finance (subcommittee a) (presiding: sen. gatchalian) sen. g.t. pecson room 2/f right wing, senate fy 2026 proposed budget of the department of information and communications technology and attached agencies scheduled"
    }
  ]
}
