{
  "generatedAt": "2025-11-02T03:18:08.277Z",
  "source": "senate.json",
  "attempts": [
    {
      "stage": "senate.json",
      "status": "ok",
      "rawCount": 6,
      "parsedCount": 6,
      "dropReasons": {
        "missingDate": 0,
        "missingCommittee": 0
      }
    }
  ],
  "warnings": [],
  "parsedCount": 6,
  "preview": [
    {
      "id": "senate-1",
      "branch": "Senate",
      "committee": "Finance (TWG)",
      "date": "2025-11-03",
      "time": "10:00 A.M.",
      "venue": "Sen. C.M. Recto Room 2/F Right Wing, Senate",
      "agenda": "FY 2026 Proposed Budget of the following agencies:; Bases Conversion Development Authority; Philippine Postal Corporation; Mindanao Development Authority; Philippine Racing Commission; Games and Amusement Board; Philippine Sports Commission; Department of Trade and Industry and attached agencies and corporations; Authority of the Freeport Area of Bataan; Cagayan Economic Zone Authority; Philippine Center for Economic Development; Subic Bay Metropolitan Authority; Zamboanga City Special Economic Zone Authority; Southern Philippines Development Authority; Department of Foreign Affairs and attached agencies; Department of Migrant Workers; Commission on Filipino Overseas; Film Development Council of the Philippines; Movie and Television Review and Classification Board; Department of Tourism and attached agencies and corporations; National Archives of the Philippines; National Commission for Culture and the Arts; National Historical Commission of the Philippines; National Library of the Philippines; Commission on Filipino Language; Cultural Center of the Philippines; Department of Environment and Natural Resources and attached agencies and corporations; Climate Change Commission; Presidential Communications Office and attached agencies and corporations",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-11-03T10:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate finance (twg) sen. c.m. recto room 2/f right wing, senate fy 2026 proposed budget of the following agencies:; bases conversion development authority; philippine postal corporation; mindanao development authority; philippine racing commission; games and amusement board; philippine sports commission; department of trade and industry and attached agencies and corporations; authority of the freeport area of bataan; cagayan economic zone authority; philippine center for economic development; subic bay metropolitan authority; zamboanga city special economic zone authority; southern philippines development authority; department of foreign affairs and attached agencies; department of migrant workers; commission on filipino overseas; film development council of the philippines; movie and television review and classification board; department of tourism and attached agencies and corporations; national archives of the philippines; national commission for culture and the arts; national historical commission of the philippines; national library of the philippines; commission on filipino language; cultural center of the philippines; department of environment and natural resources and attached agencies and corporations; climate change commission; presidential communications office and attached agencies and corporations scheduled"
    },
    {
      "id": "senate-2",
      "branch": "Senate",
      "committee": "Finance (TWG)",
      "date": "2025-11-04",
      "time": "10:00 A.M.",
      "venue": "Sen. C.M. Recto Room 2/F Right Wing, Senate",
      "agenda": "FY 2026 Proposed Budget of the following agencies:; Department of Health and attached agencies and corporations; Department of Social Welfare and Development and attached agencies; National Commission on Indigenous Peoples; The Judiciary; Department of Agriculture and attached agencies and corporations; National Irrigation Administration; Department of National Defense and attached agencies, including Revised AFP Modernization Program; National Intelligence Coordinating Agency; National Security Council; Dangerous Drugs Board; Philippine Drug Enforcement Agency; Marawi Compensation Board; National Amnesty Commission; Office of the Presidential Adviser on the Peace, Reconciliation and Unity",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-11-04T10:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate finance (twg) sen. c.m. recto room 2/f right wing, senate fy 2026 proposed budget of the following agencies:; department of health and attached agencies and corporations; department of social welfare and development and attached agencies; national commission on indigenous peoples; the judiciary; department of agriculture and attached agencies and corporations; national irrigation administration; department of national defense and attached agencies, including revised afp modernization program; national intelligence coordinating agency; national security council; dangerous drugs board; philippine drug enforcement agency; marawi compensation board; national amnesty commission; office of the presidential adviser on the peace, reconciliation and unity scheduled"
    },
    {
      "id": "senate-3",
      "branch": "Senate",
      "committee": "Public Services joint with Local Government; Ways and Means; and Finance (Presiding: Sen. R. Tulfo)",
      "date": "2025-11-04",
      "time": "10:00 A.M.",
      "venue": "Sen. G.T. Pecson Room 2/F Right Wing, Senate",
      "agenda": "S. Nos. 84, 93, 1016 and 1154 - Magna Carta of Commuters Act (Sens. R. Tulfo, M. Villar, Estrada and Villanueva); S. No. 9 - Filipino Commuters’ Rights and Welfare (By: Sen. Ejercito); S. Nos. 442 and 1112 - Transportation Network Service Act (By: Sens. R. Tulfo and Gatchalian); S. No. 1110 - Rights of Passengers of Taxis, Tourist Car Transport Services and Other Similar Vehicles for Hire (By: Sen. Gatchalian); S. Nos. 10, 356, 443 and 751 - Motorcycles-for-Hire Act (By: Sens. Ejercito, Dela Rosa, R. Tulfo and Marcos)",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-11-04T10:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate public services joint with local government; ways and means; and finance (presiding: sen. r. tulfo) sen. g.t. pecson room 2/f right wing, senate s. nos. 84, 93, 1016 and 1154 - magna carta of commuters act (sens. r. tulfo, m. villar, estrada and villanueva); s. no. 9 - filipino commuters’ rights and welfare (by: sen. ejercito); s. nos. 442 and 1112 - transportation network service act (by: sens. r. tulfo and gatchalian); s. no. 1110 - rights of passengers of taxis, tourist car transport services and other similar vehicles for hire (by: sen. gatchalian); s. nos. 10, 356, 443 and 751 - motorcycles-for-hire act (by: sens. ejercito, dela rosa, r. tulfo and marcos) scheduled"
    },
    {
      "id": "senate-4",
      "branch": "Senate",
      "committee": "Science and Technology joint with Finance (Presiding: Sen. Aquino)",
      "date": "2025-11-04",
      "time": "10:00 A.M.",
      "venue": "Sen. A.B. Padilla Room 2/F Right Wing, Senate",
      "agenda": "S. No. 1330 - The Philippine National Budget Blockchain Act (By: Sen. Aquino)",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-11-04T10:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate science and technology joint with finance (presiding: sen. aquino) sen. a.b. padilla room 2/f right wing, senate s. no. 1330 - the philippine national budget blockchain act (by: sen. aquino) scheduled"
    },
    {
      "id": "senate-5",
      "branch": "Senate",
      "committee": "Finance (TWG)",
      "date": "2025-11-05",
      "time": "10:00 A.M.",
      "venue": "Sen. C.M. Recto Room 2/F Right Wing, Senate",
      "agenda": "FY 2026 Proposed Budget of the following agencies:; Department of Agrarian Reform; Department of Science and Technology and attached agencies; Philippine Space Agency; Department of the Interior and Local Government and attached agencies; Metropolitan Baguio City, La Trinidad, Itogon, Sablan, Tuba, and Tublay Development Authority; Metropolitan Manila Development Authority; Department of Transportation and attached agencies and corporations; Department of Public Works and Highways; Department of Information and Communications Technology and attached agencies; Department of Energy and attached corporations; Energy Regulatory Commission",
      "status": "Scheduled",
      "notes": "",
      "isoDate": "2025-11-05T10:00:00",
      "source": "Senate Weekly Schedule",
      "searchText": "senate finance (twg) sen. c.m. recto room 2/f right wing, senate fy 2026 proposed budget of the following agencies:; department of agrarian reform; department of science and technology and attached agencies; philippine space agency; department of the interior and local government and attached agencies; metropolitan baguio city, la trinidad, itogon, sablan, tuba, and tublay development authority; metropolitan manila development authority; department of transportation and attached agencies and corporations; department of public works and highways; department of information and communications technology and attached agencies; department of energy and attached corporations; energy regulatory commission scheduled"
    }
  ]
}
